import java.util.Arrays;

public class JavaLoops_And_Arrays {
    public static void main(String[] args) {

//      Цикли в Java діляться на 4 види

//      Цикли з передумовою - умова виконання визначається перед першою ітерацією.
//      Цикли з постумовою - умова виконання визначається після першої ітерації
//      Цикли з лічильником: кількість ітерацій визначається змодельованим лічильником.
//      Безумовні цикли - цикли, що виконуються нескінченно. Наприклад: "Поки 1 = 1, друкувати "1 = 1"". Така програма виконуватиметься, доки її вручну не перервуть.

//      В Java є декілька циклів: for, foreach, while, do while


//      Стандартний цикл for

//      i - довільна назва змінної
//      i = 0; - початкова умова, з чого починається цикл
//      i < 5 - умова виконання циклу. Поки умова істинна, цикл виконується
//      i++ - виконується щоразу після виконання блоку (може йти і у зворотньому напрямку: і--)
        for (int i = 0; i < 5; i++) {
            System.out.println("Hello"); // 5 разів покаже
        }

//      Ми можемо збільшити наш крок. Для прикладу
        for (int w = 0; w < 9; w = w + 2) {
            System.out.println(w); // 2 4 6 8
        }


//      Цикл while проходить через блок коду до тих пір, поки задана умова true
        int i = 0;
        while (i < 9) {
            System.out.println(i); // Виведеться від 0 до 8
            i++;
        }

//      Do while похожий на простий while. Він говорить: роби щось, поки умова вірна
        int b = 0;
        do {
            System.out.println("Hello world"); // 3 рази виведеться фраза Hello world
            b++;
        } while (b < 3);

//      Масиви в Java. Оголосити масив дуже просто. Ми вказуємо тип даних, який масив буде вміщати і ставимо кв. дужки
        String[] skills;

//      Можемо зразу його наповнити
        String[] skills2 = {"One", "Two", "Three"};

//      Наший масив може бути із певною кількістю елементів
        String[] skills3 = new String[3];
        skills3[1] = "Hello";
        skills3[2] = "Hi";

//      В масивів є також певні методи
//      Дізнатись довжину масиву

        int[] methods = {5, 9, 14, 19, 1, 6, 3};
        System.out.println(methods.length); // 7

//      Сортування масиву. ToString метод допоможе нам привести/показати масив у потрібному нам вигляді
        Arrays.sort(methods);
        System.out.println(Arrays.toString(methods));

//      Перевірити чи збігаються масиви
        int[] equal1 = {1, 9, 11};
        int[] equal2 = {1, 9, 11};
        System.out.println(Arrays.equals(equal1, equal2)); // True

//      Отже, ми з масивами розібралися, а тепер як працює цикл foreach
//      Цикл foreach застосовується суто для масивів

        String[] days_of_week = {"Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"};

//      Ми вказуємо тип даних (String), вказуємо змінну в яку запишемо кожен елемент (day)
//      і пишемо змінну - назву існуючого масиву (day_of_week)

        for (String day : days_of_week) {
            System.out.println(day);
        }

    }
}
